USE Hostel

INSERT INTO Cities VALUES ('Донецк'), ('Луганск'), ('Авдеевка'), ('Макеевка'), ('Харцызск'), ('Торез'), ('Ясиноватая'), ('Красноармейск'), ('Димитров'), ('Енакиево')

INSERT INTO Floors VALUES (1), (2), (3), (4), (5)

INSERT INTO DaysWeek VALUES ('понедельник'), ('вторник'), ('среда'), ('четверг'), ('пятница'), ('суббота'), ('воскресенье')

INSERT INTO RoomTypes VALUES ('одноместный', 1, 100), ('двухместный', 2, 200), ('трехместный', 3, 300)

DECLARE @i INT
SET @i = 0;

WHILE @i < 50
BEGIN
	DECLARE @phone NVARCHAR(9), @floor INT, @phone_num INT
	if @i < 10
	SET @floor = 1
	else if @i < 20
	SET @floor = 2
	else if @i < 30
	SET @floor = 3
	else if @i < 40
	SET @floor = 4
	else
	SET @floor = 5
	SET @phone_num = 0
	SET @phone  = ''
	WHILE @phone_num < 7
	BEGIN
		if @phone_num = 3 or @phone_num = 5
			SET @phone = @phone +'-'
		SET @phone = @phone + CAST(CAST(RAND()*10 AS INT) AS NVARCHAR)
		SET @phone_num = @phone_num + 1
	END
	INSERT INTO Rooms VALUES ((RAND()*3)+1, @floor, @phone, @i+1, 1)
	SET @i = @i + 1
END;

INSERT INTO Residents (Passport, Name, Patronymic, Surname, IdCity, SettlementDate, IdRoom) VALUES
	('2834682038', 'Иван', 'Иванович', 'Иванов', 1, '20190110', 1),
	('7839127482', 'Петр', 'Петрович', 'Петров', 2, '20190101', 5),
	('1893811234', 'Елена', 'Семеновна', 'Сидорова', 5, '20190112', 10),
	('8248011293', 'Сергей', 'Сергеевич', 'Сергеев', 3, '20190115', 25),
	('8917248723', 'Татьяна', 'Алексеевна', 'Антонова', 5, '20190110', 11),
	('1235487343', 'Ольга', 'Викторовна', 'Коврова', 8, '20190112', 2),
	('1572340576', 'Егор', 'Егорович', 'Егоров', 9, '20190112', 8),
	('4562341234', 'Светлана', 'Евгеньевна', 'Павлова', 1, '20190110', 9),
	('4754313267', 'Константин', 'Иванович', 'Жуков', 2, '20190111', 15),
	('0987123423', 'Евгения', 'Андреевна', 'Смолянникова', 5, '20190110', 16)

INSERT INTO Employee VALUES
	('Елена', 'Петровна', 'Иванова'),
	('Ольга', 'Семеновна', 'Петрова'),
	('Елена', 'Алексеевна', 'Сидорова'),
	('Константин', 'Егорович', 'Сергеев'),
	('Ольга', 'Евгеньевна', 'Антонова'),
	('Евгения', 'Викторовна', 'Коврова'),
	('Иван', 'Петрович', 'Егоров'),
	('Светлана', 'Евгеньевна', 'Павлова'),
	('Константин', 'Иванович', 'Жуков'),
	('Евгения', 'Андреевна', 'Смолянникова')

INSERT INTO Сleaning VALUES
(1, 1, 1), (3, 2, 1), (5, 3, 1), (7, 4, 1), (8, 5, 1),
(5, 1, 2), (6, 2, 2), (1, 3, 2), (9, 4, 2), (10, 5, 2),
(1, 1, 3), (2, 2, 3), (3, 3, 3), (4, 4, 3), (5, 5, 3),
(6, 1, 4), (7, 2, 4), (8, 3, 4), (9, 4, 4), (10, 5, 4),
(10, 1, 5), (9, 2, 5), (8, 3, 5), (7, 4, 5), (6, 5, 5),
(5, 1, 6), (4, 2, 6), (3, 3, 6), (2, 4, 6), (1, 5, 6),
(8, 1, 7), (1, 2, 7), (4, 3, 7), (6, 4, 7), (3, 5, 7)